# DBeam_SetShow3DType

```pascal
PROCEDURE DBeam_SetShow3DType(typeFlag : INTEGER);
```

```python
def vs.DBeam_SetShow3DType(typeFlag):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|typeFlag|INTEGER|   |

## Examples
```pascal
DBeam_SetShow3DType(1);
```
```python
import vs

typeFlag = 0

vs.DBeam_SetShow3DType(typeFlag)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight